package com.omar.myapps.bottomnavapplication;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;
import android.widget.Toast;

public class DataBaseHelper extends SQLiteOpenHelper {

    private static final String DATABASE_NAME = "Prayers.db";

    public static final String SETTING_TABLE = "SETTING_TABLE";

    public static final String SETTING_Col1 = "id";
    public static final String SETTING_Col2 = "day_night";
    public static final String SETTING_Col3 = "sound_on_off";
    public static final String SETTING_Col4 = "animation_on_off";


    public static final String DUAA_FROM_QURAN_TABLE = "DUAA_FROM_QURAN_TABLE";

    public static final String DUAAFROMQURAN_Col1 = "name";
    public static final String DUAAFROMQURAN_Col2 = "Total_number";
    public static final String DUAAFROMQURAN_Col3 = "favorite_or_not";

    public static final String ALLAH_NAMES_TABLE = "ALLAH_NAMES_TABLE";

    public static final String AllahNameCol1 = "name";
    public static final String AllahNameCol2 = "Total_number";
    public static final String AllahNameCol3 = "favorite_or_not";

    public static final String MORNING_ZKR_TABLE = "MORNING_ZKR_TABLE";

    public static final String MORNING_ZKR_Col1 = "name";
    public static final String MORNING_ZKR_Col2 = "Total_number";
    public static final String MORNING_ZKR_Col3 = "favorite_or_not";

    public static final String EVENING_ZKR_TABLE = "EVENING_ZKR_TABLE";

    public static final String EVENING_ZKR_Col1 = "name";
    public static final String EVENING_ZKR_Col2 = "Total_number";
    public static final String EVENING_ZKR_Col3 = "favorite_or_not";

    public static final String FAVORITE_ZKR_TABLE = "FAVORITE_ZKR_TABLE";

    public static final String FAVORITE_ZKR_Col1 = "name";
    public static final String FAVORITE_ZKR_Col2 = "Total_number";
    public static final String FAVORITE_ZKR_Col3 = "favorite_or_not";

    private Context context;


    public DataBaseHelper(Context context) {
        super(context, DATABASE_NAME, null, 6);
        this.context = context;
    }

    @Override
    public void onCreate(SQLiteDatabase db) {

        db.execSQL("create table " + SETTING_TABLE + "(" + SETTING_Col1 + " INTEGER," + SETTING_Col2 + " TEXT,"
                + SETTING_Col3 + " TEXT ," + SETTING_Col4 + " TEXT)");

        db.execSQL("create table " + ALLAH_NAMES_TABLE + "(" + AllahNameCol1 + " TEXT," + AllahNameCol2 + " INTEGER default(0),"
                + AllahNameCol3 + " TEXT default('not favorite'))");

        db.execSQL("create table " + DUAA_FROM_QURAN_TABLE + "(" + DUAAFROMQURAN_Col1 + " TEXT," + DUAAFROMQURAN_Col2 + " INTEGER default(0),"
                + DUAAFROMQURAN_Col3 + " TEXT default('not favorite'))");

        db.execSQL("create table " + MORNING_ZKR_TABLE + "(" + MORNING_ZKR_Col1 + " TEXT," + MORNING_ZKR_Col2 + " INTEGER default(0),"
                + MORNING_ZKR_Col3 + " TEXT default('not favorite'))");

        db.execSQL("create table " + EVENING_ZKR_TABLE + "(" + EVENING_ZKR_Col1 + " TEXT," + EVENING_ZKR_Col2 + " INTEGER default(0),"
                + EVENING_ZKR_Col3 + " TEXT default('not favorite'))");


        db.execSQL("create table " + FAVORITE_ZKR_TABLE + "(" + FAVORITE_ZKR_Col1 + " TEXT," + FAVORITE_ZKR_Col2 + " INTEGER default(0),"
                + FAVORITE_ZKR_Col3 + " TEXT default('not favorite'))");


        insertPreloadedDataTOAllahNameTable(db);
        preLoadingInsertDuaafromQuran(db);
        insertPreloadedDataTOEveuing_ZKR_Table(db);
        insertPreloadedDataTOMorning_ZKR_Table(db);
        insertPreloadedDataTOSettingTable(db);

    }

    private void insertPreloadedDataTOSettingTable(SQLiteDatabase db) {

        ContentValues contentValues = new ContentValues();
        contentValues.put(SETTING_Col1, 1);
        contentValues.put(SETTING_Col2, "day");
        contentValues.put(SETTING_Col3, "on");
        contentValues.put(SETTING_Col4, "on");
        db.insert(SETTING_TABLE, null, contentValues);
        contentValues.clear();
    }


    private void insertPreloadedDataTOEveuing_ZKR_Table(SQLiteDatabase db) {
        String[] eveiningZkr = {"آية الكرسي (مرّة واحدة)\n" +
                " بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ\n"
                , " آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",

                " سورة الإخلاص (3 مرّات)\n" +
                        "        بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                        "        قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)\n" +
                        "         ", "    سورة الفلق (3 مرّات)\n" +
                "        بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "        قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)\n"
                , " سورة النّاس (3 مرّات)\n" +
                "        بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "        قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)\n" +
                "         ",
                " أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. (مرة واحدة)"
                , " اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ. (مرة واحدة)"
                , "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلّى الله عليه وسلّم نَبِيّـاً. (3 مرّات)"
                , " اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك. (4 مرّات)"
                , " اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. (مرّة واحدة)"
                , "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. (7 مرّات)", "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. (3 مرّات)", " اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. (مرة واحدة)", "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. (مرّة واحدة)", " سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه. (3 مرّات)", " اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ. (3 مرّات)",
                " اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. (3 مرّات)", " اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. (مرّة واحدة).", " يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. (3 مرّات)", " أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا. (مرّة واحدة)", " اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. (مرّة واحدة)"
                , " أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. (3 مرّات)", " اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. (10 مرّات)", " اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. (3 مرّات)",
                " اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ. (3 مرّات) ", "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ ،وَأتُوبُ إلَيهِ.(3 مرّات)",
                "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا،وَرِزْقًا طَيِّبًا،وَعَمَلًا مُتَقَبَّلًا.(مرة واحدة)", "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ،لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. (100 مرّة)", " سُبْحـانَ اللهِ وَبِحَمْـدِهِ. (100 مرّة)", " أسْتَغْفِرُ اللهَوَأتُوبُ إلَيْهِ.(100 مرّة)"
                , "  اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. (مرّة واحدة)"
        };

        ContentValues contentValues = new ContentValues();
        for (int i = 0; i < eveiningZkr.length; i++) {

            contentValues.put(DataBaseHelper.EVENING_ZKR_Col1, eveiningZkr[i]);
            db.insert(EVENING_ZKR_TABLE, null, contentValues);
        }

    }

    private void insertPreloadedDataTOMorning_ZKR_Table(SQLiteDatabase db) {
        String[] morningZkr = {"آية الكرسي (مرّة واحدة)\n" +
                " بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ\n"
                , " سورة الإخلاص (3 مرّات)\n" +
                "        بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "        قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)\n" +
                "         ", "    سورة الفلق (3 مرّات)\n" +
                "        بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "        قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)\n"
                , " سورة النّاس (3 مرّات)\n" +
                "        بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "        قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)\n" +
                "         ",
                " أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. (مرة واحدة)"
                , " اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ. (مرة واحدة)"
                , "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلّى الله عليه وسلّم نَبِيّـاً.   (3 مرّات)"
                , "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك. (4 مرّات)"
                , "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. (مرّة واحدة)"
                , "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. (7 مرّات)", "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. (3 مرّات)", " اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. (مرة واحدة)", "َصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. (مرّة واحدة)", " سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه. (3 مرّات)", " اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ. (3 مرّات)",
                " اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. (3 مرّات)", " اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. (مرّة واحدة).", " يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. (3 مرّات)", " أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم، فَـتْحَهُ، وَنَصْـرَهُ، وَنـورَهُ وَبَـرَكَتَـهُ، وَهُـداهُ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه. (مرّة واحدة)", " اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. (مرّة واحدة)"
                , " أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. (3 مرّات)", " اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. (10 مرّات)", " اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. (3 مرّات)", " اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ. (3 مرّات)", " اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ. (3 مرّات)", "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ. (3 مرّات)", " اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا. (مرة واحدة)", "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. (100 مرّة)", " سُبْحـانَ اللهِ وَبِحَمْـدِهِ. (100 مرّة)", " أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ. (100 مرّة)"};


        ContentValues contentValues = new ContentValues();
        for (int i = 0; i < morningZkr.length; i++) {

            contentValues.put(DataBaseHelper.MORNING_ZKR_Col1, morningZkr[i]);
            db.insert(MORNING_ZKR_TABLE, null, contentValues);
        }
    }

    private void insertPreloadedDataTOAllahNameTable(SQLiteDatabase db) {
        String[] AllahNames = {"الْلَّهُ",
                "الرَّحْمَنُ ", "الرَّحِيمُ ", "الْمَلِكُ", "الْقُدُّوسُ ", "السَّلاَم", "الْمُؤْمِنُ ", "الْمُهَيْمِنُ", "الْعَزِيزُ", "الْجَبَّار", "الْمُتَكَبِّر", "الْخَالِقُ", "الْبَارِئُ", "الْمُصَوِّر", "الْغَفَّارُ", "الْقَهَّار", "الْوَهَّابُ", "الرَّزَّاقُ", "الْفَتَّاحُ", "اَلْعَلِيْمُ ", "الْقَابِضُ", "الْبَاسِطُ", "الْخَافِضُ", "الرَّافِعُ", "الْمُعِزُّ ", "المُذِلُّ", "السَّمِيعُ", "الْبَصِيرُ", "الْحَكَمُ ", "الْعَدْلُ", "اللَّطِيفُ", "الْخَبِيرُ", "الْحَلِيمُ", "الْعَظِيمُ", "الْغَفُورُ", "الشَّكُورُ", "الْعَلِيُّ", "الْكَبِيرُ", "الْحَفِيظُ", "المُقيِت", "الْحسِيبُ", "الْجَلِيلُ", "الْكَرِيمُ", "الرَّقِيبُ", "الْمُجِيبُ", "الْوَاسِعُ", "الْحَكِيمُ", "الْوَدُودُ", "الْمَجِيدُ", "الْبَاعِثُ", "الشَّهِيدُ", "الْحَقُّ", "الْوَكِيلُ", "الْقَوِيُّ", "الْمَتِينُ", "الْوَلِيُّ", "الْحَمِيدُ", "الْمُحْصِي", "الْمُبْدِئُ", "الْمُعِيدُ", "الْمُحْيِي", "اَلْمُمِيتُ ", "الْحَيُّ ", "الْقَيُّومُ ", "الْوَاجِدُ ", "الْمَاجِدُ ", "الْواحِدُ ", "اَلاَحَدُ ", "الصَّمَدُ ", "الْقَادِرُ ", "الْمُقْتَدِرُ ", "الْمُقَدِّمُ ", "الْمُؤَخِّرُ ", "الأوَّلُ ", "الآخِرُ ", "الظَّاهِرُ ", "الْبَاطِنُ ", "الْوَالِي ", "الْمُتَعَالِي ", "الْبَرُّ ", "التَّوَابُ ", "الْمُنْتَقِمُ ", "العَفُوُّ ", "الرَّؤُوفُ ", "مَالِكُ الْمُلْكِ ", "ذُوالْجَلاَلِ وَالإكْرَامِ ", "الْمُقْسِطُ ", "الْجَامِعُ ", "الْغَنِيُّ ", "الْمُغْنِي ", "اَلْمَانِعُ ", "الضَّارَّ ", "النَّافِعُ ", "النُّورُ ", "الْهَادِي ", "الْبَدِيعُ ", "اَلْبَاقِي ", "الْوَارِثُ ", "الرَّشِيدُ ", "الصَّبُورُ "

        };
        ContentValues contentValues = new ContentValues();
        for (int i = 0; i < AllahNames.length; i++) {

            contentValues.put(DataBaseHelper.AllahNameCol1, AllahNames[i]);
            db.insert(ALLAH_NAMES_TABLE, null, contentValues);
        }

    }

    private void preLoadingInsertDuaafromQuran(SQLiteDatabase db) {
        String[] duaaFromQuran = {"بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ * الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ * الرَّحْمَنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّينِ * إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ * اهْدِنَا الصِّرَاط الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ. سورة الفاتحة ",
                "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ. سورة البقرة - الآية ۱۲٧",
                "وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ. سورة البقرة - الآية ۱۲۸",
                "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ. سورة البقرة - الآية ۲۰۱",
                "سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِير. سورة البقرة - الآية ۲۸٥",
                "رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. سورة البقرة - الآية ۲۸٦",
                "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ. سورة آل عمران - الآية ۸",
                "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ. سورة آل عمران - الآية ۱٦",
                "رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ. سورة آل عمران - الآية ۳۸",
                "رَبَّنَا آمَنَّا بِمَا أَنزَلَتْ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ. سورة آل عمران - الآية ٥۳",
                "ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. سورة آل عمران - الآية ۱٤٧",
                "رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ * رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ * رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ * رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ. سورة آل عمران - الآية ۱۹۱-۱۹٤",
                "رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ. سورة المائدة - الآية ۸۳",
                "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ. سورة الأعراف - الآية ۲۳",
                "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ. سورة الأعراف - الآية ٤٧",
                "أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الْغَافِرِينَ* وَاكْتُبْ لَنَا فِي هَذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ. سورة الأعراف - الآية ۱٥٥,۱٥٦",
                "حَسْبِيَ اللَّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ. سورة التوبة - الآية ۱۲۹",
                "رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ * وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِين. سورة يونس - الآية ۸٥,۸٦",
                "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ. سورة هود - الآية ٤٧",
                "رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ. سورة يوسف - الآية ۱۰۱",
                "رَبِّ اجْعَلْ هَـذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَن نَّعْبُدَ الأَصْنَامَ. سورة ابراهيم - الآية ۳٥",
                "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ. سورة ابراهيم - الآية ٤۰",
                "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ. سورة ابراهيم - الآية ٤۱",
                "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا. سورة الكهف - الآية ۱۰",
                "رَبِّ اشْرَحْ لِي صَدْرِي* وَيَسِّرْ لِي أَمْرِي* وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي، يَفْقَهُوا قَوْلِي. سورة طه - الآية ۲٥-۲۸",
                "رَّبِّ زِدْنِي عِلْمًا. سورة طه - الآية ۱۱٤",
                "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ. سورة الأنبياء - الآية ۸٧",
                "رَبِّ لا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ. سورة الأنبياء - الآية ۸۹",
                "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ * وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُون. سورة المؤمنون - الآية ۹٧,۹۸",
                "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ. سورة المؤمنون - الآية ۱۰۹",
                "رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ. سورة المؤمنون - الآية ۱۱۸",
                "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا*إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا. سورة الفرقان - الآية ٦٥,٦٦ ",
                "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا. سورة الفرقان - الآية ٧٤",
                "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ* وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الآخِرِينَ * وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ. سورة الشعراء - الآية ۸۳,۸٤,۸٥",
                "وَلا تُخْزِنِي يَوْمَ يُبْعَثُونَ * يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَ * إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ. سورة الشعراء - الآية ۸٧,۸۸,۹۹ ",
                "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِين. سورة النمل - الآية ۱۹",
                " رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْلى. سورة القصص - الآية ۱٦",
                "رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ. سورة القصص - الآية ۲۱",
                "عَسَى رَبِّي أَن يَهْدِيَنِي سَوَاءَ السَّبِيلِ. سورة القصص - الآية ۲۲",
                "رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ. سورة القصص - الآية ۲٤",
                "رَبِّ انصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ. سورة العنكبوت - الآية ۳۰",
                "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ. سورة الصافات - الآية ۱۰۰",
                "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ. سورة الأحقاف - الآية ۱٥",
                "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيمَانِ وَلا تَجْعَلْ فِي قُلُوبِنَا غِلاً لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَؤُوفٌ رَّحِيمٌ. سورة الحشر - الآية ۱۰",
                "رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ. سورة الممتحنة - الآية ٤",
                "رَبَّنَا لا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ. سورة الممتحنة - الآية ٥",
                "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. سورة التحريم - الآية ۸  ",
                "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ. سورة نوح - الآية ۲۸ "
        };


        ContentValues contentValues = new ContentValues();
        for (int i = 0; i < duaaFromQuran.length; i++) {

            contentValues.put(DUAAFROMQURAN_Col1, duaaFromQuran[i]);

            db.insert(DUAA_FROM_QURAN_TABLE, null, contentValues);
        }

    }


    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        db.execSQL("drop table if exists " + DUAA_FROM_QURAN_TABLE);
        db.execSQL("drop table if exists " + ALLAH_NAMES_TABLE);
        db.execSQL("drop table if exists " + MORNING_ZKR_TABLE);
        db.execSQL("drop table if exists " + EVENING_ZKR_TABLE);
        db.execSQL("drop table if exists " + FAVORITE_ZKR_TABLE);
        db.execSQL("drop table if exists " + SETTING_TABLE);

        onCreate(db);
    }

    public Cursor getData(String TableName) {
        SQLiteDatabase sql = this.getWritableDatabase();
        Cursor result = sql.rawQuery("select * from " + TableName, null);
        return result;
    }

    public int getSpecificDataFrom(String TableName, String zkrName) {
        SQLiteDatabase sql = this.getWritableDatabase();
        Cursor cur = sql.query(TableName, null,
                "name= ?", new String[]{zkrName}, null,
                null, null);
        if (cur != null && cur.moveToFirst()) {
            int res = Integer.parseInt(cur.getString(1));
            cur.close();
            return res;
        } else return -1;
    }

    public void updateSettingTable(String ColToBeUpdated, String newValue) {
        SQLiteDatabase sql = this.getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(ColToBeUpdated, newValue);
        sql.update(SETTING_TABLE, contentValues, "id= ?", new String[]{"1"});
    }

    public void updateDataFor(String TableName, String ColToBeUpdated, String newValue, String usingPrayerNameCol) {
        SQLiteDatabase sql = this.getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(ColToBeUpdated, newValue);
        sql.update(TableName, contentValues, "name= ?", new String[]{usingPrayerNameCol});
    }


    public void addRecordTo_FavoriteTABLE(String nameOFprayer, String favoriteOrNot) {
        SQLiteDatabase sql = getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(FAVORITE_ZKR_Col1, nameOFprayer);
        contentValues.put(FAVORITE_ZKR_Col3, favoriteOrNot);

        sql.insert(FAVORITE_ZKR_TABLE, null, contentValues);
        contentValues.clear();
        Toast.makeText(context, "one record inserted to Fav", Toast.LENGTH_SHORT).show();
    }

    public void deleteRecordTo_FavoriteTABLE(String nameOFprayer) {
        SQLiteDatabase sql = getWritableDatabase();
        sql.delete(FAVORITE_ZKR_TABLE, "name = ?", new String[]{nameOFprayer});
        Toast.makeText(context, "one record deleted to Fav", Toast.LENGTH_SHORT).show();
    }
}
